read_verilog fsm.v
show -pause
synth -run coarse
show -pause
synth_ice40
show -pause
